{
  "_metadata": {
    "project": "Question Answering Dataset",
    "description": "A dataset containing context passages, questions, and answers for training QA models and reading comprehension systems.",
    "author": "Molla Samser",
    "website": "https://rskworld.in",
    "contact": "help@rskworld.in",
    "phone": "+91 93305 39277"
  },
  "contexts": [
    {
      "id": 1,
      "text": "Artificial Intelligence (AI) is the simulation of human intelligence in machines that are programmed to think and learn like humans. The term may also be applied to any machine that exhibits traits associated with a human mind such as learning and problem-solving. Machine learning is a subset of AI that enables machines to learn from data without being explicitly programmed.",
      "domain": "Science and Technology"
    },
    {
      "id": 2,
      "text": "The Internet of Things (IoT) refers to the network of physical objects embedded with sensors, software, and other technologies for the purpose of connecting and exchanging data with other devices and systems over the internet. These devices range from ordinary household objects to sophisticated industrial tools.",
      "domain": "Science and Technology"
    },
    {
      "id": 3,
      "text": "The Renaissance was a period in European history marking the transition from the Middle Ages to Modernity and covering the 15th and 16th centuries. It occurred after the Crisis of the Late Middle Ages and was associated with great social change. The intellectual basis of the Renaissance was its version of humanism, derived from the concept of Roman humanitas.",
      "domain": "History"
    },
    {
      "id": 4,
      "text": "Shakespeare's works have been translated into every major living language and are performed more often than those of any other playwright. His plays remain highly popular and are constantly studied, performed, and reinterpreted in diverse cultural and political contexts throughout the world.",
      "domain": "Literature"
    },
    {
      "id": 5,
      "text": "The Eiffel Tower is a wrought-iron lattice tower on the Champ de Mars in Paris, France. It is named after the engineer Gustave Eiffel, whose company designed and built the tower. Constructed from 1887 to 1889 as the entrance to the 1889 World's Fair, it was initially criticized by some of France's leading artists and intellectuals for its design.",
      "domain": "General Knowledge"
    }
  ]
}

